pedidos_factu/app/controllers/autorizacions_controller.rb

  def show
    @pedido = Pedido.find(params[:idPedido])
---
SELECT * FROM "pedidos" WHERE ("pedidos"."id" = 2)

  def define_estado_pedido
    #obtenemos el objeto pedido del que se quiere cambiar su estado
    @pedido = Pedido.find(params[:id])
    # obtenemos el id del estado al que se cambiara
    # consultamos si el parametro pasado es A entonces el estado del pedido
    # es ACEPTADO caso contrario RECHAZADO
    @id_estado = params[:estado] == "A"? EstadoPedido.find_by_descripcionEstado("ACEPTADO").id : EstadoPedido.find_by_descripcionEstado("RECHAZADO").id
---
SELECT * FROM "pedidos" WHERE ("pedidos"."id" = 5)
SELECT * FROM "estado_pedidos" WHERE ("estado_pedidos"."descripcionEstado" = 'RECHAZADO') LIMIT 1