pedidos_factu/app/controllers/pedidos_controller.rb

SELECT * FROM "pedidos" ORDER BY fecha ASC
---
  def index
    @pedidos = Pedido.all(:order => "fecha ASC")

SELECT * FROM "pedidos" WHERE ("pedidos"."id" = 2)
---
  def show
    @pedido = Pedido.find(params[:id])

SELECT * FROM "estado_pedidos" WHERE ("estado_pedidos"."descripcionEstado" = 'PENDIENTE') LIMIT 1
---
  def new
    @pedido = Pedido.new
    @emisiones = Emision.find(:all)
    @estado_pedido = EstadoPedido.find_by_descripcionEstado("PENDIENTE")

SELECT * FROM "pedidos" WHERE ("pedidos"."id" = 3)
---
  def edit
    @pedido = Pedido.find(params[:id])

INSERT INTO "pedidos" ("fecha", "obs", "emision_id", "gestion_id", "usuario_id", "proveedor_id", "created_at", "updated_at") VALUES('2010-12-25 00:00:00.000000', 'sin mayor observaciones en cuanto al registro del pedido', 4, 3, 2, 1, '2010-12-25 12:49:36.056000', '2010-12-25 12:49:36.056000') RETURNING "id"
INSERT INTO "itempedidos" ("cantidad", "precioUnidad", "unidad", "descripcion", "importeTotal", "pedido_id", "created_at", "updated_at") VALUES(10.0, 2.0, 'bolsas', 'bolsas para desechos', 20.0, 2, '2010-12-25 12:49:36.230000', '2010-12-25 12:49:36.230000') RETURNING "id"
---
  def create
    @pedido = Pedido.new(params[:pedido])

    respond_to do |format|
      if @pedido.save
        #obtiene una instancia del Itempedido
        @item = @pedido.itempedidos.new(params[:itempedido])
        #obtiene una instancia de autorizacion para guardar un registro
        #del estado del pedido en PENDIENTE
        @autorizacion = @pedido.autorizacions.new(params[:autorizacion])
        if @item.save && @autorizacion.save

SELECT * FROM "pedidos" WHERE ("pedidos"."id" = 1)
DELETE FROM "pedidos" WHERE "id" = 1
---
  def destroy
    @pedido = Pedido.find(params[:id])
    @pedido.destroy