pedidos_factu/app/controllers/telefonos_controller.rb

SELECT * FROM "telefonos"
---
  def index
    @telefonos = Telefono.all