pedidos_factu/app/controllers/vigencias_controller.rb

  def index
    @vigencias = Vigencia.all
---
SELECT * FROM "vigencias"

  def show
    @vigencia = Vigencia.find(params[:id])
---
SELECT * FROM "vigencias" WHERE ("vigencias"."id" = 1)

  def create
    @vigencia = Vigencia.new(params[:vigencia])

    respond_to do |format|
      if @vigencia.save
---
INSERT INTO "vigencias" ("vigente", "created_at", "updated_at") VALUES('t', '2010-12-21 03:10:32.727000', '2010-12-21 03:10:32.727000') RETURNING "id"